departments = {
    1: '党政办公室',
    2: '档案馆',
    3: '组织部',
    4: '统战部',
    5: '宣传部',
    6: '纪委办',
    7: '监察室',
    8: '校工会',
    9: '校团委',
    10: '教务部',
    11: '招生办公室',
    12: '创新创业教育中心',
    13: '研究生院',
    14: '党委研工部',
    15: '一流大学创建办（学科办）',
    16: '社会科学部',
    17: '学报社科版',
    18: '科学技术部',
    19: '学报理工版',
    20: '学生部',
    21: '党委学工部',
    22: '国际交流与合作部',
    23: '人力资源部',
    24: '党委教师工作部',
    25: '计划财务部',
    26: '招投标管理中心',
    27: '实验室与国有资产管理部',
    28: '审计室',
    29: '后勤部',
    30: '后勤部党总支',
    31: '基建部',
    32: '安全保卫部',
    33: '离退休办公室',
    34: '校友联络部',
    35: '教育发展基金会',
    36: '机关党委',
    37: '督导室',
    38: '丽湖校区管理办公室',
    39: '师范学院（教育学部）',
    40: '艺术学部',
    41: '医学部',
    42: '马克思主义学院',
    43: '马克思主义学院党总支',
    44: '经济学院',
    45: '法学院',
    46: '人文学院',
    47: '外国语学院',
    48: '传播学院',
    49: '数学与统计学院',
    50: '物理与光电工程学院',
    51: '化学与环境工程学院',
    52: '生命与海洋科学学院',
    53: '机电与控制工程学院',
    54: '材料学院',
    55: '电子与信息工程学院',
    56: '计算机与软件学院',
    57: '建筑与城市规划学院',
    58: '土木与交通工程学院',
    59: '管理学院',
    60: '高等研究院',
    61: '金融科技学院（南特商学院）',
    62: '国际交流学院',
    63: '继续教育学院',
    64: '体育部',
    65: '体育部党总支',
    66: '图书馆',
    67: '图书馆党总支',
    68: '信息中心',
    69: '信息中心党总支',
    70: '资产经营公司',
    71: '技术转化中心',
    72: '深大总医院',
    73: '平湖医院',
    74: '校医院',
    75: '深大师院附中',
    76: '中国经济特区研究中心',
    77: '港澳基本法研究中心',
    78: '文化产业研究院',
    79: '美学与文艺批评研究院',
    80: '饶宗颐文化研究院',
    81: '城市治理研究院',
    82: '中国海外利益研究院',
    83: '微纳光电子学研究院',
    84: '脑疾病与认知科学研究中心',
}

# 暂无文章的部门：
# 党委学工部
# 党委教师工作部
# 马克思主义学院党总支
# 体育部党总支
# 信息中心党总支

if __name__ == '__main__':
    from urllib.parse import quote
    import requests
    from lxml import etree
    for i in departments.values():
        url = "https://www1.szu.edu.cn/board/mylist.asp?top=100&from=%s" \
              % quote(i.encode("gb18030"))
        content = requests.get(url).content.decode("gb18030")
        html = etree.HTML(content)
        res_title = html.xpath("//a/@title")
        print(res_title)
        print(i, quote(i.encode("gb18030")))
